content/blog/learning-haskell.org
#+title: Learning Haskell

** Books

****** Learn you a Haskell for Great Good
     Consider reading this book along with exercises(from haskell mooc).

****** Haskell Programming from First Principles

** Exercises

****** learn4haskell
****** haskell-mooc
****** cis194(spring 2013)

** Conferences

****** Functional Conference 2022

** Mailing Lists

****** [[https://haskellweekly.news/][haskellweekly]]

** Good Articles/Blogs

****** [[https://adit.io/posts/2013-04-17-functors,_applicatives,_and_monads_in_pictures.html][ Functor, Applicatives and Monads in pictures ]]

** Meetups

****** Las Gatos FP group
****** Portland FP group

** Podcasts

****** Haskell Weekly by Taylor Fausak
