public/blog/learning-haskell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning Haskell</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Learning Haskell</h1>

<div id="outline-container-org6e5abc9" class="outline-2">
<h2 id="org6e5abc9">Books</h2>
<div class="outline-text-2" id="text-org6e5abc9">
</div>
<ul class="org-ul">
<li><a id="orga5b1cba"></a>Learn you a Haskell for Great Good<br />
<div class="outline-text-6" id="text-orga5b1cba">
<p>
Consider reading this book along with exercises(from haskell mooc).
</p>
</div>
</li>

<li><a id="orgec1e291"></a>Haskell Programming from First Principles<br /></li>
</ul>
</div>

<div id="outline-container-orgdaf4423" class="outline-2">
<h2 id="orgdaf4423">Exercises</h2>
<div class="outline-text-2" id="text-orgdaf4423">
</div>
<ul class="org-ul">
<li><a id="org3513b61"></a>learn4haskell<br /></li>
<li><a id="org408be93"></a>haskell-mooc<br /></li>
<li><a id="orga39c4b5"></a>cis194(spring 2013)<br /></li>
</ul>
</div>

<div id="outline-container-org1aee0ae" class="outline-2">
<h2 id="org1aee0ae">Conferences</h2>
<div class="outline-text-2" id="text-org1aee0ae">
</div>
<ul class="org-ul">
<li><a id="orgd1928cc"></a>Functional Conference 2022<br /></li>
</ul>
</div>

<div id="outline-container-org696d123" class="outline-2">
<h2 id="org696d123">Mailing Lists</h2>
<div class="outline-text-2" id="text-org696d123">
</div>
<ul class="org-ul">
<li><a id="org812d914"></a><a href="https://haskellweekly.news/">haskellweekly</a><br /></li>
</ul>
</div>

<div id="outline-container-org31bc600" class="outline-2">
<h2 id="org31bc600">Good Articles/Blogs</h2>
<div class="outline-text-2" id="text-org31bc600">
</div>
<ul class="org-ul">
<li><a id="orgdf81bde"></a><a href="https://adit.io/posts/2013-04-17-functors,_applicatives,_and_monads_in_pictures.html"> Functor, Applicatives and Monads in pictures </a><br /></li>
</ul>
</div>

<div id="outline-container-org9ba11dd" class="outline-2">
<h2 id="org9ba11dd">Meetups</h2>
<div class="outline-text-2" id="text-org9ba11dd">
</div>
<ul class="org-ul">
<li><a id="orgc4044cf"></a>Las Gatos FP group<br /></li>
<li><a id="org6d95166"></a>Portland FP group<br /></li>
</ul>
</div>

<div id="outline-container-org31b1aa1" class="outline-2">
<h2 id="org31b1aa1">Podcasts</h2>
<div class="outline-text-2" id="text-org31b1aa1">
</div>
<ul class="org-ul">
<li><a id="org7dcdacd"></a>Haskell Weekly by Taylor Fausak<br /></li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
